_Rarzrabotki/Rarus/USO2/Documents/СМ_РазделЛокальнойСметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_РазделЛокальнойСметы</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Comment>Внутренний код</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДРодителя</Name>
					<Comment>Внутренний код</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДСметы</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректируетРаздел</Name>
					<Comment>Корректируемый раздел</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффОборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффОснЗарплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффПолнСтоимРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимЗарплатеМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимМатериалов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВДереве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВПределахСметы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_РазделыЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНРТекущая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСПТекущая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/СМ_РазделЛокальнойСметы/Forms/ФормаДокументаУпр/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

//	ФОРМА

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеРасчета = Объект.Расчет Тогда
		СМ_СметаВызовСервера.УстановитьРасчетУПодчиненных(Объект.Ссылка, Объект.Расчет);	
	КонецЕсли;
	
	Документы.СМ_РазделЛокальнойСметы.Перерасчет(ТекущийОбъект, Ложь, Ложь, ?(Параметры.РазделАкта, Параметры.Акт, Неопределено));// sudav - замена 
	
	ЗаписатьЗначенияПоАкту();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отказ = СМ_ЗащитаКлиент.ЗапускОбъекта();
	Если Не Отказ Тогда
		УправлениеВидимостью();
	КонецЕсли;
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;

	Если Параметры.ПоказатьРядом Тогда
		ПодключитьОбработчикОжидания("ЗакрепитьСправа",1);
	КонецЕсли;                                                                         

КонецПроцедуры

&НаКлиенте
Процедура ЗакрепитьСправа()
    Если ЭтаФорма.ВводДоступен() Тогда                          
        WSHShell = Новый COMОбъект("WScript.Shell");
        WSHShell.SendKeys("%");
        WSHShell.SendKeys("{DOWN 5}");
        WSHShell.SendKeys("{RIGHT}");
        WSHShell.SendKeys("{UP 5}");
		WSHShell.SendKeys("{ENTER}");
		ОтключитьОбработчикОжидания("ЗакрепитьСправа");
		ПодключитьОбработчикОжидания("АктивизируемФормуСметы",0.1,Истина);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АктивизируемФормуСметы() 
	ОткрытыеОкна = ПолучитьОкна();
	Для Каждого ТекОкно Из ОткрытыеОкна Цикл
		Если ТекОкно.Основное ИЛИ ТекОкно.НачальнаяСтраница Тогда
			Продолжить;
		КонецЕсли;
		ФормаОкна = ТекОкно.Содержимое[0];
		Если ЭтаФорма.ВладелецФормы = ФормаОкна Тогда
			ФормаОкна.Активизировать();
		КонецЕсли;
	КонецЦикла;
	ОтключитьОбработчикОжидания("АктивизируемФормуСметы");
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьСтруктуруСметы();
	
	Если Параметры.РазделАкта Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("АктВыполненныхРабот",Параметры.Акт);
		Оповестить("ОбновитьДерево",СтруктураПараметров);
	Иначе
		СписокДействий = Новый Массив;
		СписокДействий.Добавить("ОбновитьДерево");
		СписокДействий.Добавить("ПеренумероватьДерево");
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("СписокДействий",СписокДействий);
		СтруктураПараметров.Вставить("Смета",Объект.ИДСметы);
		СтруктураПараметров.Вставить("НовыйОбъект",Объект.Ссылка);
		Оповестить("ОбновитьДеревоСметы",СтруктураПараметров);
	КонецЕсли;
	УправлениеВидимостью();
	
	Если Параметры.ПоказатьРядом Тогда
		ПодключитьОбработчикОжидания("АктивизируемФормуСметы",0.1,Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    ЭтотОбъект.ПроверитьЗаполнение();
КонецПроцедуры

//	ЭЛЕМЕНТЫ ФОРМЫ

&НаКлиенте
Процедура РазделОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка	= Ложь;
	
	ДополнительныеПараметры	= Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение);
	
	ОписаниеОповещения		= Новый ОписаниеОповещения("РазделПриИзмененииОповещениеНаКлиенте", ЭтотОбъект, ДополнительныеПараметры);
	
	Кнопки	= Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Отмена	, "Отмена");
	Кнопки.Добавить(КодВозвратаДиалога.ОК		, "Продолжить");
	
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Будет изменено наименование для печати!';"), Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделКорректируемыйНажатие(Элемент, СтандартнаяОбработка)
	Пар = Новый Структура("Ключ", Объект.КорректируетРаздел);
	ОткрытьФорму("Документ.СМ_РазделЛокальнойСметы.ФормаОбъекта",Пар,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	СтандартнаяОбработка = Ложь;	

КонецПроцедуры

&НаКлиенте
Процедура КоэффПолнСтоимРаботПриИзменении(Элемент)
	Если Объект.КоэффПолнСтоимРабот <> 0  Тогда
		Объект.КоэффОснЗарплаты = Объект.КоэффПолнСтоимРабот;
		Объект.КоэффОборуд = Объект.КоэффПолнСтоимРабот;
		Объект.КоэффСтоимЗарплатеМашин = Объект.КоэффПолнСтоимРабот;
		Объект.КоэффСтоимМатериалов =  Объект.КоэффПолнСтоимРабот;
		Объект.КоэффСтоимЭксплМашин =  Объект.КоэффПолнСтоимРабот;
		ПоказатьПредупреждениеНаФорме(НСтр("ru='Задан коэффициент к полной стоимости, коэффициенты к элементам равны коэффициенту к полной стоимости!'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоэффОснЗарплатыПриИзменении(Элемент)
	Если Объект.КоэффПолнСтоимРабот <> 0  Тогда
		Объект.КоэффПолнСтоимРабот = 0;
		СкрытьПредупреждениеНаФорме();		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КоэффСтоимЭксплМашинПриИзменении(Элемент)
	Если Объект.КоэффПолнСтоимРабот <> 0  Тогда
		Объект.КоэффПолнСтоимРабот = 0;
		СкрытьПредупреждениеНаФорме();		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КоэффСтоимЗарплатеМашинПриИзменении(Элемент)
	Если Объект.КоэффПолнСтоимРабот <> 0  Тогда
		Объект.КоэффПолнСтоимРабот = 0;
		СкрытьПредупреждениеНаФорме();		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КоэффСтоимМатериаловПриИзменении(Элемент)
	Если Объект.КоэффПолнСтоимРабот <> 0  Тогда
		Объект.КоэффПолнСтоимРабот = 0;
		СкрытьПредупреждениеНаФорме();		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура КоэффОборудПриИзменении(Элемент)
	Если Объект.КоэффПолнСтоимРабот <> 0  Тогда
		Объект.КоэффПолнСтоимРабот = 0;
		СкрытьПредупреждениеНаФорме();		
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РазделПриИзмененииОповещениеНаКлиенте(КодВозврата, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если КодВозврата = КодВозвратаДиалога.ОК Тогда
		
		Объект.Раздел					= ДополнительныеПараметры["ВыбранноеЗначение"][0];
		Объект.НаименованиеДляПечати	= СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(ДополнительныеПараметры["ВыбранноеЗначение"][0], "Наименование");
		
		УправлениеВидимостью();
				
	КонецЕсли;
	
КонецПроцедуры //Процедура РазделПриИзмененииОповещениеНаКлиенте(КодВозврата, ДополнительныеПараметры = Неопределено) Экспорт

&НаСервере
Процедура ОбновитьСтруктуруСметы()
	
	Раздел = РеквизитФормыВЗначение("Объект");

	СтруктураПараметровРасчетаЛС = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(Объект.ИДСметы,Раздел);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	ЗначениеРасчета = Объект.Расчет;
	
	Если Объект.Ссылка.Пустая() Тогда
		Если ЗначениеЗаполнено(Объект.ИДРодителя) Тогда
			СМ_СметаВызовСервера.ЗаполнитьДанныеДокументаВСтруктуреСмет(Объект, Объект.ИДРодителя, ЛОЖЬ);
		КонецЕсли;
	Иначе
		// Обновляем нумерацию.
		Номера = СМ_СметаВызовСервера.ПолучитьНомерДокумента(Объект.Ссылка, "СМ_РазделЛокальнойСметы");
		ПорНомер = Номера.ПорНомер;   
	КонецЕсли;
	
	ОбновитьСтруктуруСметы();

	ТолькоПросмотрФормы = СМ_СметаВызовСервера.РольТолькоПросмотр();
	
	СуществуютАкты = СМ_УчетВыполненныхРаботСервер.СуществуютАктыПоСмете(Объект.ИДСметы);
	
	Если СтруктураПараметровРасчетаЛС = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Документ не имеет привязки к локальной смете.'"));
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
	КонецЕсли;
	
	ОбновитьЗначенияПоАкту();

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "СтраницаДополнительныеРеквизиты");
		ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Ложь);
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	КонецЕсли;
	
	Если Не Пользователи.РолиДоступны("СМ_АдминистраторСмета, ПолныеПрава") Тогда
		Элементы.ФормаПоказатьРасчеты.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредупреждениеНаФорме(Текст)
	
	Элементы.ТекстПредупреждения.Видимость = Истина;
	Элементы.ТекстПредупреждения.Доступность = Истина;
	ТекстПредупреждения = Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПредупреждениеНаФорме()
	
	Элементы.ТекстПредупреждения.Видимость = Ложь;
	Элементы.ТекстПредупреждения.Доступность = Ложь;
	ТекстПредупреждения = "";
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()
	
	СкрытьПредупреждениеНаФорме();
	
	Элементы.ГруппаСтраницы.Видимость = (СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРаздел);
	Элементы.ГруппаСтраницы.Доступность = (СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРаздел);
	
	Элементы.ГруппаКоэффициенты.Видимость = (СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРаздел)и(Не(Параметры.РазделАкта));
	Элементы.ГруппаКоэффициенты.Доступность = (СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРаздел)и(Не(Параметры.РазделАкта));
	
	Элементы.ГруппаКоэффициентыАкта.Видимость = (СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРаздел)и(Параметры.РазделАкта);
	Элементы.ГруппаКоэффициентыАкта.Доступность = (СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРаздел)и(Параметры.РазделАкта);
	
	Элементы.НаименованиеДляПечатиРес.Доступность 	= (НЕ СуществуютАкты);
		
	Элементы.ВидРабот.ТолькоПросмотр 					= (СуществуютАкты);
	Элементы.КоэффОснЗарплаты.ТолькоПросмотр 			= (СуществуютАкты);
	Элементы.КоэффСтоимЭксплМашин.ТолькоПросмотр 		= (СуществуютАкты);
	Элементы.КоэффСтоимЗарплатеМашин.ТолькоПросмотр 	= (СуществуютАкты);
	Элементы.КоэффСтоимМатериалов.ТолькоПросмотр 		= (СуществуютАкты);
	Элементы.КоэффОборуд.ТолькоПросмотр 				= (СуществуютАкты);
	Элементы.КоэффПолнСтоимРабот.ТолькоПросмотр 		= (СуществуютАкты);
	
	Элементы.ВидРаботАкта.ТолькоПросмотр 					= (Не Параметры.РазделАкта);
	Элементы.КоэффОснЗарплатыАкта.ТолькоПросмотр 			= (Не Параметры.РазделАкта);
	Элементы.КоэффСтоимЭксплМашинАкта.ТолькоПросмотр 		= (Не Параметры.РазделАкта);
	Элементы.КоэффСтоимЗарплатеМашинАкта.ТолькоПросмотр 	= (Не Параметры.РазделАкта);
	Элементы.КоэффСтоимМатериаловАкта.ТолькоПросмотр 		= (Не Параметры.РазделАкта);
	Элементы.КоэффОборудАкта.ТолькоПросмотр 				= (Не Параметры.РазделАкта);
	Элементы.КоэффПолнСтоимРаботАкта.ТолькоПросмотр 		= (Не Параметры.РазделАкта);
	
	Элементы.Раздел.Доступность 		= Не СуществуютАкты;
	Элементы.Расчет.Доступность 		= Не СуществуютАкты;    
	
	Если (СуществуютАкты И (Не Параметры.РазделАкта)) Тогда
		ПоказатьПредупреждениеНаФорме(НСтр("ru='Существуют акты, введенные по данной смете. Раздел не может быть отредактирован!'"));
	КонецЕсли;
	
	Если Параметры.РазделАкта Тогда
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Раздел №%1 %2'"), ПорНомер, СМ_СметаКлиент.ПолучитьТекстИнформацииОбАкте(Параметры.Акт, СтруктураПараметровРасчетаЛС, НСтр("ru='акта выполненных работ'")));
	Иначе
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Раздел №%1 %2'"), ПорНомер, СМ_СметаКлиент.ПолучитьТекстИнформацииОСмете(Объект,СтруктураПараметровРасчетаЛС, НСтр("ru='локальной сметы'")));                    
	КонецЕсли;
	Элементы.РазделКорректируемый.Видимость 		= ЗначениеЗаполнено(Объект.КорректируетРаздел);
	Элементы.РазделКорректируемый.Доступность		= ЗначениеЗаполнено(Объект.КорректируетРаздел);
	РазделКорректируемый = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Корректируемый раздел №%1'"), СМ_СметаКлиент.ПолучитьТекстИнформацииОРазделе(Объект.КорректируетРаздел));
	
	Если ТолькоПросмотрФормы Тогда
		Для каждого Элем Из ЭтаФорма.Элементы Цикл
			Если ТипЗнч(Элем) = Тип("ДекорацияФормы") ИЛИ ТипЗнч(Элем) = Тип("ДополнениеЭлементаФормы") ИЛИ Элем = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ТипЗнч(Элем) = Тип("КнопкаФормы") Тогда
				Элем.Доступность = Ложь;
			Иначе
				Элем.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЦикла;
		// ДокторСофт
		ЭтаФорма.КоманднаяПанель.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ОбновитьЗначенияПоАкту()
	
	Если (Параметры.РазделАкта) Тогда
		
		СтрокаРаздел = СМ_СметаВызовСервера.СтрокаРазделаАкта(Параметры.Акт, Объект.Ссылка);	
		
		// индексы могут отличаться
		Если ЗначениеЗаполнено(СтрокаРаздел) Тогда
			ЗаполнитьЗначенияСвойств(ЭтаФорма, СтрокаРаздел, "ВидРабот, КоэффОборуд, КоэффОснЗарплаты, КоэффПолнСтоимРабот, КоэффСтоимЗарплатеМашин, КоэффСтоимМатериалов, КоэффСтоимЭксплМашин");
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗначенияПоАкту()
	
	Если (Параметры.РазделАкта) Тогда
		
		ОбъектАкт = Параметры.Акт.ПолучитьОбъект();
		СтрокаРаздел = СМ_СметаВызовСервера.СтрокаРазделаАкта(ОбъектАкт, Объект.Ссылка);
		
		// индексы могут отличаться
		Если ЗначениеЗаполнено(СтрокаРаздел) Тогда
			ЗаполнитьЗначенияСвойств(СтрокаРаздел, ЭтаФорма, "ВидРабот, КоэффОборуд, КоэффОснЗарплаты, КоэффПолнСтоимРабот, КоэффСтоимЗарплатеМашин, КоэффСтоимМатериалов, КоэффСтоимЭксплМашин");
		КонецЕсли;
		
		ОбъектАкт.Записать();
				
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Поддержка дополнительных реквизитов.

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		Если МодульУправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
			ОбновитьЭлементыДополнительныхРеквизитов();
			МодульУправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)

	Если Параметры.ПоказатьРядом Тогда
		Закрыть(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРасчеты(Команда)
	ПараметрыФормы = Новый Структура("ВыбранныйДокумент", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.СМ_ИтогиПоДокументу", ПараметрыФормы); 
КонецПроцедуры

#КонецОбласти

#Область НаУдаление

//&НаСервере
//Процедура Удалить_СвойстваВыполнитьОтложеннуюИнициализацию()
//	
//	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
//		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
//		МодульУправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
//	КонецЕсли;
//	
//КонецПроцедуры

#КонецОбласти
